// 회사별 경력 상세 정보 타입
type CompanyHistory = {
  company: string;
  period: string;
  position: string;
  description: string[];
  clientBasedProjects: string[];
  details: string[];
};

// 회사별 경력 상세 정보 데이터
export const companyHistories: CompanyHistory[] = [
  {
    company: "아이로그인",
    period: "2021.12 ~ 2022.05",
    position: "백엔드 개발자",
    description: ["웹 서비스 백엔드,프론트엔드 개발 및 유지보수 담당"],
    clientBasedProjects: [
      "기후솔루션",
      "성엔지니어링",
      "국보디자인",
      "휴리엔",
      "모든에너지",
      "FLB",
      "바이오컴플릿",
    ],
    details: [
      "- PHP 기반 CMS 기능 개발 및 유지보수관리자 페이지나 게시판 같은 기능을 상황에 맞게 새로 만들거나 수정",
      "- 기존 코드를 분석해 구조를 바꿔가며 유지보수",
      "- 협업 및 비동기 처리 구현 퍼블리셔와 긴밀히 협업하면서 반응형 레이아웃이 무너지지 않게 UI 부분을 맞췄고, AJAX 방식으로 게시글 등록이나 문의 폼 제출 등 사용자 입력을 처리. 실시간으로 서버와 통신하는 부분은 주로 jQuery와 PHP를 작업",
      "- 회원 관리 및 인증 시스템 구현 로그인, 회원가입은 물론이고 관리자 승인 기능도 일부 개발. 로그인 시 이메일 인증이 필요하거나, 특정 조건에 따라 접근 권한을 제한하는 구조도 직접 구현",
      "- 사용자 맞춤형 폼 및 DB 연동, 백엔드에서는 이를 DB와 연동해서 저장, 수정, 삭제까지 처리했습니다. 데이터가 제대로 들어가고 출력되도록 쿼리도 직접 다룸",
      "- 이메일 자동 발송 기능 구현 회원가입이나 문의 접수 등 특정 액션이 발생했을 때, 자동으로 메일이 발송되도록 로직을 설계하고 운영 환경에 반영",
      "- 전자상거래 기능 일부 구현 쇼핑몰 관련 프로젝트에서는 상품 등록, 주문 처리 등 일부 기능을 맡아서 구현했고, DB 구조를 분석하면서 백엔드와 프론트 간 데이터 흐름을 연결하는 데 집중",
    ],
  },
  {
    company: "주식회사 뱅코",
    period: "2022.08 ~ 2023.08",
    position: "풀스택 개발자",
    description: [
      "뱅코 메인 홈페이지 리모델링 Front-end 개발",
      "보라비트 가상거래소 홈페이지 제작 및 버그 해결",
    ],
    clientBasedProjects: [
      "보라비트",
      "마인코더(외주)",
      "뱅코게임즈",
      "뱅코 홈페이지",
    ],
    details: [
      "- 보라비트 가상화폐 거래소 웹사이트 개발PHP 기반의 백엔드를 중심으로 회원가입, 로그인, 포인트 충전 등 기본 기능을 직접 구현 실거래 데이터가 오가는 구조였기 때문에, 서버와 DB 사이의 데이터 처리 로직 구현과 디버깅에 특히 신경을 많이 썼으며, 거래 내역 저장, 포인트 변동 기록 등 주요 기능의 오류를 찾아 수정하고, 운영 중 발생한 예외 케이스 처리도 함께 진행",
      "- 자사 메인 및 게임 홈페이지 리뉴얼메인 홈페이지는 JS로 동적인 UI 효과를 추가하면서 기존의 정적인 구조를 개선했고, 사용자 편의성을 높이는 데 중점을 둠. 게임 홈페이지는 처음부터 전체 개편 프로젝트로 진행됐고, React + PHP 조합으로 Full-stack 개발",
      "- 반응형 웹으로 제작해서 다양한 기기에서도 문제 없이 작동되도록 했고, 페이지 구조나 흐름도 사용자 관점에서 재정비",
      "- 디버깅 및 유지보수 업무운영 중 포인트 충전 오류나 회원정보 수정·삭제 문제 등 다양한 버그를 발견하고 수정 관리자 페이지 기능도 일부 보완하면서 UI도 조금씩 개선했고, 새로 생기는 기능에 대한 유지보수도 병행",
      "- 외주 개발사 협업 및 품질 점검외주사에서 개발한 VPN 관련 프로그램 품질을 점검하면서 실제 요구사항과 맞지 않는 부분을 수정 요청하거나직접 기능 일부를 수정 React 기반 UI에 PHP 기능을 연동하는 구조에서 연계 작업 담당",
      "- DB 설계 보조 및 관리MySQL 기반으로 회원 정보, 거래 이력, 탈퇴 처리 등을 저장하는 테이블 설계에 참여, 실시간 거래 데이터가 누적되면서 생기는 DB 부하나 오류를 확인하고, 쿼리 성능을 개선하거나 오류를 수정하는 업무",
    ],
  },
];

export type { CompanyHistory };
